//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// ActionState
//-----------------------------------------------------------------------------

namespace eRaven.Domain.Enums;

public enum ActionState : short
{
    PlanAction = 1,      //планується
    ApprovedOrder = 2    //виконано наказом
}