//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// DocumentStatus
//-----------------------------------------------------------------------------

namespace eRaven.Domain.Enums;

/// <summary>
/// Стан документа.
/// Викристовується для позначення статусу документа в системі.
/// - Draft: Чернетка, документ ще не опублікований.
/// - Posted: Опублікований, документ активний.
/// - Canceled: Скасований, документ більше не дійсний.
/// 
/// В draft користувач може редагувати документ.
/// В posted документ фіксується в системі і не може бути змінений.
/// В canceled документ позначається як недійсний і не використовується в подальших операціях. 
/// </summary>
public enum DocumentStatus
{
    /// <summary>
    /// Чернетка
    /// <see cref="Draft"/>
    /// </summary>
    Draft = 0,

    /// <summary>
    /// Опублікований
    /// <see cref="Posted"/>
    /// </summary>
    Posted = 1,

    /// <summary>
    /// Скасований
    /// <see cref="Canceled"/>
    /// </summary>
    Canceled = 2
}