//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// EnrollmentKind
//-----------------------------------------------------------------------------

namespace eRaven.Domain.Enums;

/// <summary>
/// Тип зарахування/врахування особи у підрозділі.
/// </summary>
public enum EnrollmentKind
{
    /// <summary>
    /// Зарахований у підрозділ (списки).
    /// </summary>
    Unit = 0,

    /// <summary>
    /// Приряджений по бр (не список).
    /// </summary>
    AttachedByOrder = 1,

    /// <summary>
    /// Приряджений по котлу (списки)
    /// </summary>
    AttachedByList = 2
}
