//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// MissionMode
//-----------------------------------------------------------------------------

using eRaven.Domain.Entities;

namespace eRaven.Domain.Enums;

/// <summary>
/// Режим готовності для виконання завдань
/// Використовується в <see cref="Mission"/>
/// 
/// Режими:
/// - день
/// - ніч
/// - цілодобово
/// </summary>
public enum MissionMode
{
    Day = 0,
    Night = 1,
    FullTime = 2
}
