//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// MoveType
//-----------------------------------------------------------------------------

namespace eRaven.Domain.Enums;

public enum MoveType
{
    Dispatch = 1,  // Відправлення
    Return = 2,    // Повернення
}
