//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// PersonLifecycle
//-----------------------------------------------------------------------------

namespace eRaven.Domain.Enums;

/// <summary>
/// Життєвий цикл особи
/// </summary>
public enum PersonLifecycle
{
    /// <summary>
    /// Кандідат. Не у табелі, не планується.
    /// </summary>
    Candidate = 0,

    /// <summary>
    /// Зарахований в штат (або при ряджений). Можна вести табель/планування.
    /// </summary>
    Enrolled = 1,

    /// <summary>
    /// Виключений зі штата. Не можна вести табель/планування.
    /// </summary>
    Excluded = 2
}
