//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// PersonLifecycle
//-----------------------------------------------------------------------------

namespace eRaven.Domain.Enums;

/// <summary>
/// Життєвий цикл особи
/// </summary>
public enum PersonLifecycle
{
    /// <summary>
    /// Резервна картка. Не можна вести табель/планування.
    /// </summary>
    Reserved = 0,

    /// <summary>
    /// Принятий. Можна вести табель/планування.
    /// </summary>
    Enrolled = 1
}
