//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// PlanState
//-----------------------------------------------------------------------------

namespace eRaven.Domain.Enums;

/// <summary>
/// Стан плану: відкрито або закрито (закриття оформлюється наказом).
/// </summary>
public enum PlanState
{
    Open = 1,
    Close = 2
}
