//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// PlanActionState
//-----------------------------------------------------------------------------

namespace eRaven.Domain.Enums;

public enum PlanActionState : short
{
    Draft = 0,      //чернетка
    Approved = 1,   //погоджено
    Superseded = 2  //замінено
}