//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// PlanActionType
//-----------------------------------------------------------------------------

namespace eRaven.Domain.Enums;

/// <summary>
/// Тип плану: відрядити або повернути.
/// </summary>
public enum PlanActionType
{
    Dispatch = 1,  // відрядити / відправити
    Return = 2     // повернути
}
