//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// PositionUnitState
//-----------------------------------------------------------------------------

namespace eRaven.Domain.Enums;

/// <summary>
/// Визначає стан зайнятості одиниці позиції.
/// </summary>
/// <remarks>Використовуйте це перелічення, щоб вказати, чи є одиниця посади вакантною чи зайнятою на даний момент.
/// Це може бути корисним для управління ресурсами, планування або відстеження доступності в системі.</remarks>
public enum PositionUnitState
{
    /// <summary> 
    /// Вакантний стан посади. Не закріплена за особою.
    /// </summary>
    Vacant = 0,
    /// <summary> 
    /// Не вакантний стан посади. Закріплена за особою.
    /// </summary>
    Occupied = 1,
    /// <summary>
    /// Тимчасово зайнята особою, яка виконує обов'язки.
    /// </summary>
    TemporarilyOccupied = 2,
    /// <summary>
    /// Призначена для кандидата.
    /// </summary>     
    TemporarilyCandidate = 3
}
