//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// ITargetCatalog
//-----------------------------------------------------------------------------

namespace eRaven.Application.Catalogs.CombatTask.Targets;

/// <summary>
/// Каталог цілей бойових завдань
/// - використовується в CombatTask documents (Доукменти планування)
/// 
/// Поточні цілі:
/// "Розвідка, ураження, доставка БпАК",
/// "Охорона СтП БпАК",
/// "Охорона РТЗ",
/// "Інженерні роботи",
/// "Забезпечення СтП (водії)"
/// </summary>
public interface ITargetCatalog
{
    IReadOnlyList<TargetOption> GetActive();
}
