//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// GetCombatTaskPersonLookupQuery
//-----------------------------------------------------------------------------

namespace eRaven.Application.Queries.CombatTask;

/// <summary>
/// Повертає список осіб, які можуть бути призначені на завдання, 
/// тобто не мають інших завдань на вказану дату. 
/// Використовується для заповнення випадаючого списку при створенні/редагуванні завдання.
/// 
/// <see cref="IsPlanned"/> визначає, чи враховувати заплановані завдання
/// (тобто ті, які ще не почалися, але вже призначені).
/// true - враховувати заплановані завдання, false - не враховувати.
/// </summary>
public record GetCombatTaskPersonLookupQuery(DateOnly OnDate, bool IsPlanned);
