//-----------------------------------------------------------------------------
// All rights by agreement of the developer. Author data on GitHub Khrapal M.G.
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// GetTimesheetRangeQuery
//-----------------------------------------------------------------------------

namespace eRaven.Application.Queries.Timesheets;

/// <summary>
/// Запит для тижневого табеля. Параметри From та To визначають діапазон дат, для яких потрібно отримати дані. 
/// Параметр Search використовується для фільтрації результатів за певним критерієм 
/// (наприклад, ім'я працівника або код завдання).
/// </summary>
public sealed record GetTimesheetsRangeQuery(DateOnly From, DateOnly To, string? Search);
